fixture/vcr_cassettes/response_ok.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n  <soapenv:Header />\n  <soapenv:Body>\n    <cli:consultaCEP>\n      <cep>54250-610</cep>\n    </cli:consultaCEP>\n  </soapenv:Body>\n</soapenv:Envelope>\n",
      "headers": {
        "content-type": "text/xml; charset=utf-8"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente"
    },
    "response": {
      "binary": false,
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><ns2:consultaCEPResponse xmlns:ns2=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\"><return><bairro>Cavaleiro</bairro><cep>54250610</cep><cidade>Jaboatão dos Guararapes</cidade><complemento2></complemento2><end>Rua Fernando Amorim</end><uf>PE</uf></return></ns2:consultaCEPResponse></soap:Body></soap:Envelope>",
      "headers": {
        "Date": "Mon, 12 Nov 2018 20:21:40 GMT",
        "X-OPNET-Transaction-Trace": "a2_775e147f-6d65-40a0-9fce-104c705ba27e",
        "Content-Type": "text/xml;charset=UTF-8",
        "Content-Length": "399",
        "Vary": "Accept-Encoding,User-Agent",
        "Set-Cookie": "_op_aixPageId=a2_775e147f-6d65-40a0-9fce-104c705ba27e; Path=/"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]